# 1) Напишите функцию, которая принимает натуральное число и выводит его
# последнюю цифру

def poslednee():
    a = int(input('введите число: '))
    b=str(a)
    print(b[-1])
poslednee()
